// Виправляємо імпорт на пакетний, щоб лінтер був задоволений
import 'package:my_project/models/user_model.dart';

// Це абстрактний клас (інтерфейс), який описує, що має вміти репозиторій.
// Це потрібно, щоб у майбутньому ми могли легко змінити сховище
// (наприклад, з пам'яті телефону на інтернет-базу), не ламаючи весь код.
abstract class IAuthRepository {
  // План методу для збереження користувача
  Future<void> saveUser(UserModel user);
  
  // План методу для отримання даних користувача
  Future<UserModel?> getUser();
}
